Table of Contents
 Class CrossSectionCreepCoefficientAttribute
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section creep coefficient attribute
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentsCreepCoefficientAttribute,CI.CrossSection")]
public class CrossSectionCreepCoefficientAttribute : OpenAttribute
Inheritance
object
OpenObject
OpenAttribute
CrossSectionCreepCoefficientAttribute
Inherited Members
 OpenAttribute.Element
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create attributes for creep calculation.
//Creating the model
OpenModel openModel = new OpenModel();
//Set creep definition - on component 0, creep and notional size are calculated, humidity 60%
CrossSectionCreepCoefficientAttribute creepAttr = new CrossSectionCreepCoefficientAttribute();
creepAttr.Element = new ReferenceElement(css);
CrossSectionCreepCoefficientData creepComp = new CrossSectionCreepCoefficientData();
creepComp.CreepInput = InputValueType.Calculate;
creepComp.ComponentIndex = new List<int>() { 0 };
creepComp.Humidity = 0.6;
creepComp.NotionalSizeInput = InputValueType.Calculate;
creepAttr.Components.Add(creepComp);
openModel.AddObject(creepAttr);
Constructors
 CrossSectionCreepCoefficientAttribute()
Constructor
public CrossSectionCreepCoefficientAttribute()
Properties
 Components
List of components
public List<CrossSectionCreepCoefficientData> Components { get; set; }
Property Value
List<CrossSectionCreepCoefficientData>
 Edit this page